In [23]:
#data anonmally outlyer
#Median-based Anomaly Detection

import pandas as pd
import numpy as np

In [24]:
X = pd.Series([2.1, 2.3, 4.5, 2.3, 2.9])
X

0    2.1
1    2.3
2    4.5
3    2.3
4    2.9
dtype: float64

In [25]:

median=X.median()
median

2.3

In [ ]:
std=np.std(x)
std

In [26]:
thrashold=2
outlier=[]


for item in X:
    if abs(item-median)> thrashold:
        outlier.append(item)
        print (outlier)

[4.5]

In [27]:
print (outlier) #outlier

[4.5]

In [30]:
#Mean-based Anomaly Detection
x = pd.Series([2.1, 2.3, 4.5, 2.3, 2.9])
mean=np.mean(x)
mean

2.82

In [31]:
std=np.std(x)
std

0.8818163074019442

In [32]:
thrashold=2
outlier=[]
for item in x:
    if (item < mean-std) or (item> mean+std):
        outlier.append(item)
        print (outlier)

[4.5]

In [34]:
#z score  based 
outlier=[]
print(outlier)
for item in x:
    z_score=(item-mean)/std
    if z_score > 1.5:
        outlier.append(item)

outlier

[]

[4.5]

In [38]:
import pandas as pd
import numpy as np
x = pd.Series([2.1, 2.3, 4.5, 2.2, 2.5])
Q1, Q3 = np.percentile (x, [25,75])
IQR = Q3 - Q1
outliers =[]
for item in x:
   if item < (Q1-1.5*IQR) or item >(Q3 +1.5 * IQR):
      outliers.append(item)
outliers

[4.5]

In [47]:
# missing data
from numpy import NaN
data1 = {'Name': ['Edison', 'Edward', 'James', 'Neesham'], 'Age': [28,27, NaN, 36]}
data3=data = pd.DataFrame.from_dict(data1)
data

      Name   Age
0   Edison  28.0
1   Edward  27.0
2    James   NaN
3  Neesham  36.0

In [48]:
data.isnull()

    Name    Age
0  False  False
1  False  False
2  False   True
3  False  False

In [49]:
data.isnull().sum()

Name    0
Age     1
dtype: int64

In [50]:
#dealing with missing value
data.dropna(inplace=True)
#drop that row which have missing value

In [51]:
data

      Name   Age
0   Edison  28.0
1   Edward  27.0
3  Neesham  36.0

In [53]:
from numpy import NaN
data1 = {'Name': ['Edison', 'Edward', 'James', 'Neesham'], 'Age': [28,27, NaN, 36]}
data3=data = pd.DataFrame.from_dict(data1)
data

      Name   Age
0   Edison  28.0
1   Edward  27.0
2    James   NaN
3  Neesham  36.0

In [55]:
data['Age'].mode()

0    27.0
Name: Age, dtype: float64

In [54]:
#replace missing value 
data['Age'].fillna(data['Age'].mode()[0],inplace=True)
data

C:\Users\saeed\AppData\Local\Temp\ipykernel_1680\2993724376.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Age'].fillna(data['Age'].mode()[0],inplace=True)

      Name   Age
0   Edison  28.0
1   Edward  27.0
2    James  27.0
3  Neesham  36.0

In [ ]:
#reguller expression 
import re

In [61]:


text="Python, created by Guido van Rossum in 1991, derives its name from the British comedy group Monty Python. Renowned for its simplicity and readability, Python's syntax emphasizes code clarity through significant whitespace. With a thriving community, Python boasts an extensive library ecosystem, catering to diverse domains like web development, data science, machine learning, and automation. Its popularity continues to soar, consistently ranking among top programming languages. Supported by frameworks like Django and Flask for web development, and tools such as NumPy, pandas, TensorFlow, and PyTorch, Python embodies versatility and ease of learning. It adheres to 'The Zen of Python,' a philosophy guiding programmers towards elegant code. Python's ubiquity spans across industry and academia, cementing its status as a powerhouse in the programming world."

In [65]:
#find screach 
x=re.findall('name from the British comedy group Monty Pytho',text)
x

['name']

In [63]:
#find dights
x=re.findall('\d',text)
x

<>:2: SyntaxWarning: invalid escape sequence '\d'
<>:2: SyntaxWarning: invalid escape sequence '\d'
C:\Users\saeed\AppData\Local\Temp\ipykernel_1680\758419749.py:2: SyntaxWarning: invalid escape sequence '\d'
  x=re.findall('\d',text)

['1', '9', '9', '1']

In [66]:
x=re.findall('\d+',text)
x

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\saeed\AppData\Local\Temp\ipykernel_1680\1887652791.py:1: SyntaxWarning: invalid escape sequence '\d'
  x=re.findall('\d+',text)

['1991']

In [81]:
import pandas as pd
import re
txtList = ['Pakistan', 'Indonesia', 'Jordan', 'Pakistan','India','Iran']
txt = pd.Series (txtList)
txt

0     Pakistan
1    Indonesia
2       Jordan
3     Pakistan
4        India
5         Iran
dtype: object

In [83]:
dtype: object
re.findall('India', txt.to_string())

['India']

In [ ]:
#re.serach

In [88]:
text='hello world'
found_obj=re.search('world',text) #return object 
found_obj

In [91]:
found_obj.span()

(6, 11)

In [ ]:
#repace text in string

In [92]:


text="Python, created by Guido van Rossum in 1991, derives its name from the British comedy group Monty Python. Renowned for its simplicity and readability, Python's syntax emphasizes code clarity through significant whitespace. With a thriving community, Python boasts an extensive library ecosystem, catering to diverse domains like web development, data science, machine learning, and automation. Its popularity continues to soar, consistently ranking among top programming languages. Supported by frameworks like Django and Flask for web development, and tools such as NumPy, pandas, TensorFlow, and PyTorch, Python embodies versatility and ease of learning. It adheres to 'The Zen of Python,' a philosophy guiding programmers towards elegant code. Python's ubiquity spans across industry and academia, cementing its status as a powerhouse in the programming world."

In [94]:
text

"Python, created by Guido van Rossum in 1991, derives its name from the British comedy group Monty Python. Renowned for its simplicity and readability, Python's syntax emphasizes code clarity through significant whitespace. With a thriving community, Python boasts an extensive library ecosystem, catering to diverse domains like web development, data science, machine learning, and automation. Its popularity continues to soar, consistently ranking among top programming languages. Supported by frameworks like Django and Flask for web development, and tools such as NumPy, pandas, TensorFlow, and PyTorch, Python embodies versatility and ease of learning. It adheres to 'The Zen of Python,' a philosophy guiding programmers towards elegant code. Python's ubiquity spans across industry and academia, cementing its status as a powerhouse in the programming world."

In [93]:
re.sub(pattern='Python',repl='Java',string=text)

"Java, created by Guido van Rossum in 1991, derives its name from the British comedy group Monty Java. Renowned for its simplicity and readability, Java's syntax emphasizes code clarity through significant whitespace. With a thriving community, Java boasts an extensive library ecosystem, catering to diverse domains like web development, data science, machine learning, and automation. Its popularity continues to soar, consistently ranking among top programming languages. Supported by frameworks like Django and Flask for web development, and tools such as NumPy, pandas, TensorFlow, and PyTorch, Java embodies versatility and ease of learning. It adheres to 'The Zen of Java,' a philosophy guiding programmers towards elegant code. Java's ubiquity spans across industry and academia, cementing its status as a powerhouse in the programming world."

In [ ]:
#https://regex101.com/is a very good website to create and test regular expressions.
#We have also added some resources to learn more about regular expression in Python